[{"id":2071518,"title":"New 2023 Coachmen RV Leprechaun 298KB Ford 450","link":"https://www.alpinhausrv.com.com/product/new-2023-coachmen-rv-leprechaun-298kb-ford-450-2071518-16","description":"Coachmen Leprechaun Class C gas motorhome 298KB highlights:  Double Slides Outside Entertainment Center King Bed Countertop Extension Bunk Over Cab    Take in the charm and style found on this Leprechaun Class C gas motorhome! The king bed slide is the perfect complement to the rear master suite, and the 44\u0022 x 76\u0022 J-lounge with 18\u0022 extension and 62\u0022 sofa are excellent additions to the living area. The kitchen has a three-burner cooktop with cover as well as a residential-size microwave oven for preparing easy meals. Take the party outside to the exterior entertainment center, or stay inside and watch the interior 39\u0022 TV.   With each Leprechaun Class C gas motorhome by Coachmen you will enjoy \u0022better\u0022 interior appointments, like the premium hardwood cabinet doors and drawer fronts, the one-piece thermofoil countertops, and the premium vinyl flooring. You will sleep soundly each night on the upgraded mattress, and staying clean will be easy with the premium showerhead and faucet in the bath. These models include reclining cockpit seats, cruise control, and a rear backup camera so you can easily get in and out of the campground. The Leprechaun is constructed with Azdel composite sidewalls, CrossFlex PVC, polyester reinforced roof material, and vacu-bond laminated walls, roof, and floor for a durable motorhome made to last.","price":158211,"image_link":"https://assets-cdn.interactcp.com/alpinhaus/unit_photo/imgh_800x600-wm_alpinhausrv_com_com-m0216202321184838/unit_photo_202302160918483830468426.jpg","categories":["Motor Home Class C","Saratoga, NY"]},{"id":2205630,"title":"Used 2021 Forest River RV IBEX 19QBS","link":"https://www.alpinhausrv.com.com/product/used-2021-forest-river-rv-ibex-19qbs-2205630-29","description":"Forest River IBEX travel trailer 19QBS highlights:  Sofa with Table Under-Bed Storage Pantry Pass-Through Storage Single Axle Panoramic Front Window    This easy-to-tow single axle IBEX includes a single slide for more interior space and is loaded with features for you to enjoy while fishing, hunting, camping or going off-grid.  As you walk into this trailer, you will find a 6 cubic foot refrigerator on your left so that you can grab an ice-cold drink on your way out, and while you remain indoors, you can always prepare something delicious on the two-burner cooktop.  You might like to add the optional griddle outside for more choices when feeding everyone.  A full bathroom will be one of the greatest additions to have in the middle of the night when you don\u0027t want to search for the public facilities, and throughout the night you will be comforted as you sleep on the front queen bed with super storage underneath and nightstands to place your cellphone and such.   Each IBEX travel trailer and toy hauler from Forest River are built lightweight and ready for any outdoor enthusiast from the all terrain tires and increased ground clearance, the Rhino Rack RVT tracks, the solar system with large panel, controller and 1000W inverter plus the Cold Weather package with heated and enclosed underbelly, tank pad heaters and enclosed termination system.  The interior will keep you comfortable with the bedding and furniture included, the JBL wireless Bluetooth audio system, the 15K air conditioner and the kitchen and bathroom amenities.  Make your selection today and start your adventure!  ","price":24999,"image_link":"https://cdn.impel.io/swipetospin-viewers/alpinhausrvssorangecounty/1ujbc0aj7t1y50231/20250912144853.FUDCVPM5/closeups/cu-0.jpg","categories":["Travel Trailer","Saratoga, NY"]}]


